In [4]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [5]:
import sys

In [6]:
iris=pd.read_csv('./Pandas/iris.csv')

In [7]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [8]:
df=pd.DataFrame(iris)
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [9]:
df.to_csv('newcsv.csv', index=False)

In [10]:
### view our iris DF as csv

In [11]:
### Add a rank column to the iris DataFrame, ranking the petal length 
### in an ascending order

In [12]:
df = df.sort_values(by='petal_length')
df

     sepal_length  sepal_width  petal_length  petal_width    species
22            4.6          3.6           1.0          0.2     setosa
13            4.3          3.0           1.1          0.1     setosa
14            5.8          4.0           1.2          0.2     setosa
35            5.0          3.2           1.2          0.2     setosa
36            5.5          3.5           1.3          0.2     setosa
..            ...          ...           ...          ...        ...
131           7.9          3.8           6.4          2.0  virginica
105           7.6          3.0           6.6          2.1  virginica
117           7.7          3.8           6.7          2.2  virginica
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica

[150 rows x 5 columns]

In [13]:
##Find the mean of each column for each species

In [14]:
means_by_species = df.groupby('species').mean()
means_by_species

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             5.006        3.418         1.464        0.244
versicolor         5.936        2.770         4.260        1.326
virginica          6.588        2.974         5.552        2.026

In [15]:
## Create a new DataFrame for each of the species separately - 
# should have 3 in total, make sure each index starts at 0

In [16]:
species_dfs = []
for species_name in df['species'].unique():
    species_df = df[df['species'] == species_name].reset_index(drop=True)
    species_dfs.append(species_df)

In [17]:
for i, species_df in enumerate(species_dfs):
    print(f"Species {i + 1}: {species_df['species'][0]}")
    print(species_df.head())

Species 1: setosa
   sepal_length  sepal_width  petal_length  petal_width species
0           4.6          3.6           1.0          0.2  setosa
1           4.3          3.0           1.1          0.1  setosa
2           5.8          4.0           1.2          0.2  setosa
3           5.0          3.2           1.2          0.2  setosa
4           5.5          3.5           1.3          0.2  setosa
Species 2: versicolor
   sepal_length  sepal_width  petal_length  petal_width     species
0           5.1          2.5           3.0          1.1  versicolor
1           5.0          2.3           3.3          1.0  versicolor
2           4.9          2.4           3.3          1.0  versicolor
3           5.0          2.0           3.5          1.0  versicolor
4           5.7          2.6           3.5          1.0  versicolor
Species 3: virginica
   sepal_length  sepal_width  petal_length  petal_width    species
0           4.9          2.5           4.5          1.7  virginica
1           6.0          3.0           4.8          1.8  virginica
2           6.2          2.8           4.8          1.8  virginica
3           5.6          2.8           4.9          2.0  virginica
4           6.3          2.7           4.9          1.8  virginica

In [18]:
##Create two final DataFrames: One for the Sepal information, 
# and one for the Petal information. 
# This should be done on the whole dataset so that in each DataFrame 
# we have information about all three species

In [19]:
sepal_df = df[['sepal_length', 'sepal_width', 'species']]


petal_df = df[['petal_length', 'petal_width', 'species']]
sepal_df

     sepal_length  sepal_width    species
22            4.6          3.6     setosa
13            4.3          3.0     setosa
14            5.8          4.0     setosa
35            5.0          3.2     setosa
36            5.5          3.5     setosa
..            ...          ...        ...
131           7.9          3.8  virginica
105           7.6          3.0  virginica
117           7.7          3.8  virginica
122           7.7          2.8  virginica
118           7.7          2.6  virginica

[150 rows x 3 columns]

In [20]:
petal_df

     petal_length  petal_width    species
22            1.0          0.2     setosa
13            1.1          0.1     setosa
14            1.2          0.2     setosa
35            1.2          0.2     setosa
36            1.3          0.2     setosa
..            ...          ...        ...
131           6.4          2.0  virginica
105           6.6          2.1  virginica
117           6.7          2.2  virginica
122           6.7          2.0  virginica
118           6.9          2.3  virginica

[150 rows x 3 columns]

In [1]:
import seaborn as sns

In [22]:
# Load the titanic dataset in seaborn (it is a sample dataset 
# - load using 'sns.load_dataset('titanic')')

# Clean the dataset - where are the missing values, 
# can they be filled/need to be dropped? Are there any duplicates?

# Find the average fare and age for each class
# Add a new column showing the fare as a percentage of total
# How many survivors were female compared to male?
# What interesting insights can you draw?

In [ ]:
## Pandas basic

In [39]:
import pandas as pd
import numpy as np

In [5]:
from pandas import Series, DataFrame

In [ ]:
## Series

In [7]:
x=pd.Series([10,20,30,40,50])
x

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
x.values

array([10, 20, 30, 40, 50])

In [13]:
data=[450,650,870]
index=['A','B','C']
sales=Series(data,index)
sales

A    450
B    650
C    870
dtype: int64

In [14]:
type(sales)

pandas.core.series.Series

In [15]:
sales.index

Index(['A', 'B', 'C'], dtype='object')

In [16]:
sales.values

array([450, 650, 870])

In [17]:
sales["A"]

450

In [18]:
sales[0]

/var/folders/4l/psnxz4_s0v3d7rpy_ykz1lhc0000gn/T/ipykernel_779/1101347017.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  sales[0]

450

In [20]:
sales>500

A    False
B     True
C     True
dtype: bool

In [21]:
"A" in sales

True

In [22]:
"a" in sales

False

In [23]:
"450" in sales

False

In [25]:
sales[[False,True,True]]

B    650
C    870
dtype: int64

In [26]:
sales

A    450
B    650
C    870
dtype: int64

In [28]:
sales_dict=sales.to_dict()
sales_dict

{'A': 450, 'B': 650, 'C': 870}

In [30]:
sales_series=Series(sales_dict)
sales_series

A    450
B    650
C    870
dtype: int64

In [33]:
sales

A    450
B    650
C    870
dtype: int64

In [36]:
new_sales=Series(sales,index=['A','B','D'])
new_sales

A    450.0
B    650.0
D      NaN
dtype: float64

In [40]:
np.isnan(new_sales["A"])

False

In [41]:
np.isnan(new_sales["D"])

True

In [42]:
np.isnan(new_sales)

A    False
B    False
D     True
dtype: bool

In [43]:
pd.isnull(new_sales)

A    False
B    False
D     True
dtype: bool

In [44]:
sales.index.name="Sales Person"
sales

Sales Person
A    450
B    650
C    870
dtype: int64

In [45]:
sales

Sales Person
A    450
B    650
C    870
dtype: int64

In [46]:
sales.name="TV show"

In [47]:
sales

Sales Person
A    450
B    650
C    870
Name: TV show, dtype: int64

In [ ]:
## DataFrame

In [49]:
data=[['A',20],['B', 23],['C',41]]
df=pd.DataFrame(data,columns=['Name','Age'])
df

  Name  Age
0    A   20
1    B   23
2    C   41

In [51]:
new_dict={'Name':['A','B','C','D'],'Sales':[250,123,234,234]}
df_dict=pd.DataFrame(new_dict)
df_dict

  Name  Sales
0    A    250
1    B    123
2    C    234
3    D    234

In [ ]:
#add a custom index

In [52]:
new_dict

{'Name': ['A', 'B', 'C', 'D'], 'Sales': [250, 123, 234, 234]}

In [54]:
df_dict_index=pd.DataFrame(new_dict, index=['rank 1', 'rank 2', 'rank 3', 'rank 4'])
df_dict_index

       Name  Sales
rank 1    A    250
rank 2    B    123
rank 3    C    234
rank 4    D    234

In [ ]:
## useful when working with json

In [55]:
dict_list=[{'Name':'Tom','Sales':250},{'Name':'SAF','Sales':350},{'Name':'JAne','Sales':210},{'Name':'jim','Sales':150}]
df_dict_list=pd.DataFrame(dict_list)
df_dict_list

   Name  Sales
0   Tom    250
1   SAF    350
2  JAne    210
3   jim    150

In [ ]:
##dataframe from a dictionery of series

In [56]:
east=pd.Series([1000,2000,123,122],index=['Q1','Q2','Q3','Q4'])
east

Q1    1000
Q2    2000
Q3     123
Q4     122
dtype: int64

In [57]:
west=pd.Series([4500,3400,1230,1222],index=['Q1','Q2','Q3','Q4'])
west

Q1    4500
Q2    3400
Q3    1230
Q4    1222
dtype: int64

In [58]:
df_region=pd.DataFrame({'East':east,'West':west})
df_region

    East  West
Q1  1000  4500
Q2  2000  3400
Q3   123  1230
Q4   122  1222

In [59]:
df_region['North']=[122,233,234,2341]
df_region['South']=[1242,2323,2324,23241]
df_region

    East  West  North  South
Q1  1000  4500    122   1242
Q2  2000  3400    233   2323
Q3   123  1230    234   2324
Q4   122  1222   2341  23241

In [ ]:
#index should be years, not Qs

In [62]:
years=['2016','2017','2018','2019']
df_region['Years']=years
df_region

    East  West  North  South Years
Q1  1000  4500    122   1242  2016
Q2  2000  3400    233   2323  2017
Q3   123  1230    234   2324  2018
Q4   122  1222   2341  23241  2019

In [64]:
df_region=df_region.set_index('Years')
df_region

       East  West  North  South
Years
2016   1000  4500    122   1242
2017   2000  3400    233   2323
2018    123  1230    234   2324
2019    122  1222   2341  23241

In [65]:
new_df=df_region.reindex(['2017','2018','2019','2020','2021'])
new_df

         East    West   North    South
Years
2017   2000.0  3400.0   233.0   2323.0
2018    123.0  1230.0   234.0   2324.0
2019    122.0  1222.0  2341.0  23241.0
2020      NaN     NaN     NaN      NaN
2021      NaN     NaN     NaN      NaN

In [77]:
re_indexed=new_df.reindex(columns=['North','South','East','New'])
re_indexed

        North    South    East  New
Years
2017    233.0   2323.0  2000.0  NaN
2018    234.0   2324.0   123.0  NaN
2019   2341.0  23241.0   122.0  NaN
2020      NaN      NaN     NaN  NaN
2021      NaN      NaN     NaN  NaN

In [78]:
re_indexed.fillna(0)

        North    South    East  New
Years
2017    233.0   2323.0  2000.0  0.0
2018    234.0   2324.0   123.0  0.0
2019   2341.0  23241.0   122.0  0.0
2020      0.0      0.0     0.0  0.0
2021      0.0      0.0     0.0  0.0

In [79]:
re_indexed.fillna(method='ffill')

/var/folders/4l/psnxz4_s0v3d7rpy_ykz1lhc0000gn/T/ipykernel_779/2995548471.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  re_indexed.fillna(method='ffill')

        North    South    East  New
Years
2017    233.0   2323.0  2000.0  NaN
2018    234.0   2324.0   123.0  NaN
2019   2341.0  23241.0   122.0  NaN
2020   2341.0  23241.0   122.0  NaN
2021   2341.0  23241.0   122.0  NaN

In [80]:
re_indexed.interpolate()
# re_indexed.dropna()

        North    South    East  New
Years
2017    233.0   2323.0  2000.0  NaN
2018    234.0   2324.0   123.0  NaN
2019   2341.0  23241.0   122.0  NaN
2020   2341.0  23241.0   122.0  NaN
2021   2341.0  23241.0   122.0  NaN

In [81]:
re_indexed.dropna()

Empty DataFrame
Columns: [North, South, East, New]
Index: []

In [84]:
re_indexed

        North    South    East  New
Years
2017    233.0   2323.0  2000.0  NaN
2018    234.0   2324.0   123.0  NaN
2019   2341.0  23241.0   122.0  NaN
2020      NaN      NaN     NaN  NaN
2021      NaN      NaN     NaN  NaN

In [85]:
re_indexed.dropna(axis=0, how='all')

        North    South    East  New
Years
2017    233.0   2323.0  2000.0  NaN
2018    234.0   2324.0   123.0  NaN
2019   2341.0  23241.0   122.0  NaN

In [86]:
re_indexed

        North    South    East  New
Years
2017    233.0   2323.0  2000.0  NaN
2018    234.0   2324.0   123.0  NaN
2019   2341.0  23241.0   122.0  NaN
2020      NaN      NaN     NaN  NaN
2021      NaN      NaN     NaN  NaN

In [93]:
re_indexed.dropna(thresh=4)

Empty DataFrame
Columns: [North, South, East, New]
Index: []

In [92]:
re_indexed.dropna(thresh=2)

        North    South    East  New
Years
2017    233.0   2323.0  2000.0  NaN
2018    234.0   2324.0   123.0  NaN
2019   2341.0  23241.0   122.0  NaN

In [95]:
df_dup=DataFrame([['A',1],['B',2],['A',1]])
df_dup.duplicated()

0    False
1    False
2     True
dtype: bool

In [96]:
df_dup

   0  1
0  A  1
1  B  2
2  A  1

In [102]:
df_dup.drop_duplicates(inplace=True)
df_dup

   0  1
0  A  1
1  B  2

In [103]:
new_df['North']

Years
2017     233.0
2018     234.0
2019    2341.0
2020       NaN
2021       NaN
Name: North, dtype: float64

In [104]:
new_df.iloc[2]

East       122.0
West      1222.0
North     2341.0
South    23241.0
Name: 2019, dtype: float64

In [105]:
new_df

         East    West   North    South
Years
2017   2000.0  3400.0   233.0   2323.0
2018    123.0  1230.0   234.0   2324.0
2019    122.0  1222.0  2341.0  23241.0
2020      NaN     NaN     NaN      NaN
2021      NaN     NaN     NaN      NaN

In [106]:
new_df[1:3]

        East    West   North    South
Years
2018   123.0  1230.0   234.0   2324.0
2019   122.0  1222.0  2341.0  23241.0

In [107]:
new_df.loc['2019']

East       122.0
West      1222.0
North     2341.0
South    23241.0
Name: 2019, dtype: float64

In [110]:
new_df.loc[['2018','2019']]

        East    West   North    South
Years
2018   123.0  1230.0   234.0   2324.0
2019   122.0  1222.0  2341.0  23241.0

In [113]:
new_df

         East    West   North    South
Years
2017   2000.0  3400.0   233.0   2323.0
2018    123.0  1230.0   234.0   2324.0
2019    122.0  1222.0  2341.0  23241.0
2020      NaN     NaN     NaN      NaN
2021      NaN     NaN     NaN      NaN

In [111]:
new_df.loc[[False,False, True, True, True]]

        East    West   North    South
Years
2019   122.0  1222.0  2341.0  23241.0
2020     NaN     NaN     NaN      NaN
2021     NaN     NaN     NaN      NaN

In [115]:
new_df

         East    West   North    South
Years
2017   2000.0  3400.0   233.0   2323.0
2018    123.0  1230.0   234.0   2324.0
2019    122.0  1222.0  2341.0  23241.0
2020      NaN     NaN     NaN      NaN
2021      NaN     NaN     NaN      NaN

In [116]:
new_df[new_df['West']>1000]

         East    West   North    South
Years
2017   2000.0  3400.0   233.0   2323.0
2018    123.0  1230.0   234.0   2324.0
2019    122.0  1222.0  2341.0  23241.0

In [ ]:
## adding colums works in the same way for Series

In [117]:
new_df

         East    West   North    South
Years
2017   2000.0  3400.0   233.0   2323.0
2018    123.0  1230.0   234.0   2324.0
2019    122.0  1222.0  2341.0  23241.0
2020      NaN     NaN     NaN      NaN
2021      NaN     NaN     NaN      NaN

In [118]:
new_df['East']+new_df['West']

Years
2017    5400.0
2018    1353.0
2019    1344.0
2020       NaN
2021       NaN
dtype: float64

In [120]:
new_df['East'].add(new_df['West'], fill_value=0)

Years
2017    5400.0
2018    1353.0
2019    1344.0
2020       NaN
2021       NaN
dtype: float64

In [ ]:
## sortingby index

In [123]:
new_df.sort_values(by=['North'])

         East    West   North    South
Years
2017   2000.0  3400.0   233.0   2323.0
2018    123.0  1230.0   234.0   2324.0
2019    122.0  1222.0  2341.0  23241.0
2020      NaN     NaN     NaN      NaN
2021      NaN     NaN     NaN      NaN

In [125]:
df_temp=DataFrame(np.arange(16).reshape(4,4))
df_temp

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [126]:
a=np.arange(16)
a

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15])

In [128]:
df_temp=DataFrame(np.arange(16).reshape(4,4), index=[['2018','2018','2019','2019'], ['Jan','Apr','Jan','Apr']], columns=[['NY','NY','LA','LA'],['cold','hot','cold','hot']])
df_temp

           NY       LA
         cold hot cold hot
2018 Jan    0   1    2   3
     Apr    4   5    6   7
2019 Jan    8   9   10  11
     Apr   12  13   14  15

In [130]:
df_temp.index.names=['Year','Month']
df_temp

             NY       LA
           cold hot cold hot
Year Month
2018 Jan      0   1    2   3
     Apr      4   5    6   7
2019 Jan      8   9   10  11
     Apr     12  13   14  15

In [132]:
df_temp.columns.names=['State','Temp']
df_temp

State        NY       LA
Temp       cold hot cold hot
Year Month
2018 Jan      0   1    2   3
     Apr      4   5    6   7
2019 Jan      8   9   10  11
     Apr     12  13   14  15

In [133]:
df_temp.swaplevel('State','Temp', axis=1)

Temp       cold hot cold hot
State        NY  NY   LA  LA
Year Month
2018 Jan      0   1    2   3
     Apr      4   5    6   7
2019 Jan      8   9   10  11
     Apr     12  13   14  15

In [ ]:
## sort based in the first level of the index

In [136]:
df_temp

State        NY       LA
Temp       cold hot cold hot
Year Month
2018 Jan      0   1    2   3
     Apr      4   5    6   7
2019 Jan      8   9   10  11
     Apr     12  13   14  15

In [138]:
df_temp.sort_index(level=0)

State        NY       LA
Temp       cold hot cold hot
Year Month
2018 Apr      4   5    6   7
     Jan      0   1    2   3
2019 Apr     12  13   14  15
     Jan      8   9   10  11

In [137]:
df_temp.sort_index(level=1)

State        NY       LA
Temp       cold hot cold hot
Year Month
2018 Apr      4   5    6   7
2019 Apr     12  13   14  15
2018 Jan      0   1    2   3
2019 Jan      8   9   10  11

In [140]:
df_temp

State        NY       LA
Temp       cold hot cold hot
Year Month
2018 Jan      0   1    2   3
     Apr      4   5    6   7
2019 Jan      8   9   10  11
     Apr     12  13   14  15

In [139]:
df_temp['NY']['cold']

Year  Month
2018  Jan       0
      Apr       4
2019  Jan       8
      Apr      12
Name: cold, dtype: int64

In [141]:
df_temp.iloc[0]

State  Temp
NY     cold    0
       hot     1
LA     cold    2
       hot     3
Name: (2018, Jan), dtype: int64

In [143]:
df_temp

State        NY       LA
Temp       cold hot cold hot
Year Month
2018 Jan      0   1    2   3
     Apr      4   5    6   7
2019 Jan      8   9   10  11
     Apr     12  13   14  15

In [142]:
df_temp.loc['2018','Jan']

State  Temp
NY     cold    0
       hot     1
LA     cold    2
       hot     3
Name: (2018, Jan), dtype: int64

In [ ]:
## write the ris DF to a new csv file

In [145]:
import sys